app/controllers/locations_controller.rb

  def index
    @locations = Location.all
    @geojson = Array.new

    @locations.each do |location|
---
SELECT "locations".* FROM "locations"